## Creation of the database

In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect('test.db')

In [3]:
conn.execute('''CREATE TABLE COMPAGNY
    (ID INT PRIMARY KEY  NOT NULL,
     NAME          TEXT NOT NULL,
     AGE           INT NOT NULL,
     ADRESS        CHAR(50),
     SALARY        REAL);''')

In [4]:
conn.close()

# Insert Operation

In [5]:
import sqlite3

In [6]:
conn=sqlite3.connect('test.db')

In [7]:
conn.execute("INSERT INTO COMPAGNY (ID,NAME,AGE,ADRESS,SALARY) \
              VALUES (1,'Paul',32,'California',20000.00 )");

In [8]:
conn.execute("INSERT INTO COMPAGNY (ID,NAME,AGE,ADRESS,SALARY) \
              VALUES (2,'Allen',25,'Texas',15000.00 )");

In [9]:
conn.execute("INSERT INTO COMPAGNY (ID,NAME,AGE,ADRESS,SALARY) \
              VALUES (3,'Teddy',23,'Norway',20000.00 )");

In [10]:
conn.execute("INSERT INTO COMPAGNY (ID,NAME,AGE,ADRESS,SALARY) \
              VALUES (4,'Mark',25,'Rich-Mond',65000.00 )");

In [11]:
conn.commit()

In [12]:
conn.close()

## SELECT Operation

In [13]:
import sqlite3

In [14]:
conn=sqlite3.connect('test.db')

In [15]:
cursor=conn.execute("SELECT id, name,adress,salary from COMPAGNY")

In [16]:
for row in cursor:
    print "ID = ",row[0]
    print "NAME = ",row[1]
    print "ADRESS = ",row[2]
    print "SALARY = ",row[3], "\n"

ID =  1
NAME =  Paul
ADRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
ADRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADRESS =  Rich-Mond
SALARY =  65000.0

In [17]:
conn.close()

## Update operation

In [18]:
import sqlite3

In [19]:
conn=sqlite3.connect('test.db')

In [20]:
conn.execute("UPDATE COMPAGNY set SALARY = 25000.00 where ID=1")

In [21]:
conn.commit()

In [22]:
cursor=conn.execute("SELECT id, name,adress,salary from COMPAGNY")

In [23]:
for row in cursor:
    print "ID = ",row[0]
    print "NAME = ",row[1]
    print "ADRESS = ",row[2]
    print "SALARY = ",row[3], "\n"

ID =  1
NAME =  Paul
ADRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
ADRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADRESS =  Rich-Mond
SALARY =  65000.0

## Delete Operation

In [24]:
import sqlite3

In [25]:
conn=sqlite3.connect('test.db')

In [26]:
conn.execute("DELETE from COMPAGNY where ID=2;")

In [27]:
conn.commit()

In [28]:
cursor=conn.execute("SELECT id, name,adress,salary from COMPAGNY")

In [29]:
for row in cursor:
    print "ID = ",row[0]
    print "NAME = ",row[1]
    print "ADRESS = ",row[2]
    print "SALARY = ",row[3], "\n"

ID =  1
NAME =  Paul
ADRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
ADRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADRESS =  Rich-Mond
SALARY =  65000.0

In [30]:
conn.close()